-----------------------포스관리 프로그램--------------------------
1.주문   2.결제   3.메뉴관리   4.통계   5.프로그램 종료
--------------------------------------------------------------
이동하고 싶은 메뉴 번호를 입력하세요 : 2

=========================
테이블 리스트
*테이블 주문현황
1	분식		떡볶이	1	4000
1	면류		라면		1	5000
2	분식		순대		2	10000
2	면류		냉면		3	24000
3	주류		소주 	2	10000				 
3	식사		제육덮밥 	1	9000

테이블 번호 입력: 1

1.결제 방법 선택   2.결제 완료   3.결제 취소   4.결제 재등록

원하는 항목을 선택해주세요
번호: 1

==결제 방법 선택==
1.현금 2.카드 0.초기화면

번호: 1

==결제 처리==
1.테이블 결제
2.분할 결제

번호: 1


결제하시겠습니까?
1.예  2.아니오

번호: 1
=========================
테이블 리스트
*테이블 주문현황
1	분식		떡볶이	0	0
1	면류		라면		0	0
2	분식		순대		2	10000
2	면류		냉면		3	24000
3	주류		소주 	2	10000				 
3	식사		제육덮밥 	1	9000

결제가 완료되었습니다.

-----------------------포스관리 프로그램--------------------------
1.주문   2.결제   3.메뉴관리   4.통계   5.프로그램 종료
--------------------------------------------------------------
이동하고 싶은 메뉴 번호를 입력하세요 : 2

=========================
테이블 리스트
*테이블 주문현황
1	분식		떡볶이	0	0
1	면류		라면		0	0
2	분식		순대		2	10000
2	면류		냉면		3	24000
3	주류		소주 	2	10000				 
3	식사		제육덮밥 	1	9000

테이블 번호 입력: 2

1.결제 방법 선택   2.결제 완료   3.결제 취소   4.결제 재등록

원하는 항목을 선택해주세요
번호: 1

==결제 방법 선택==
1.현금 2.카드 0.초기화면

번호: 2
====결제 처리====
1.테이블 전체 결제
2.분할 결제
0.뒤로 가기

번호: 2

==분할결제==
메뉴 번호: 면류
수량: 2
총 금액: 16000

테이블 번호를 선택하시겠습니까?
1.선택  2.완료

번호: 1

테이블 번호 입력: 2
메뉴번호: 분식
수량: 1
총 금액: 5000

테이블 번호를 선택하시겠습니까?
1.선택 2.완료

번호:2

메뉴번호:분식
수량:1
남은 금액:5000

메뉴번호:면류
수량:1
남은 금액: 8000

결제하시겠습니까?
1.예 2.아니오

번호:1

=========================
  테이블 리스트
*테이블 주문현황
1	분식		떡볶이	0	0
1	면류		라면		0	0
2	분식		순대		0	0
2	면류		냉면		0	0
3	주류		소주 	2	10000				 
3	식사		제육덮밥 	1	9000

-----------------------포스관리 프로그램--------------------------
1.주문   2.결제   3.메뉴관리   4.통계   5.프로그램 종료
--------------------------------------------------------------
이동하고 싶은 메뉴 번호를 입력하세요 : 2

=========================
  테이블 리스트
*테이블 주문현황
1	분식		떡볶이	0	0
1	면류		라면		0	0
2	분식		순대		0	0
2	면류		냉면		0	0
3	주류		소주 	2	10000				 
3	식사		제육덮밥 	1	9000

테이블 번호 입력: 1

1.결제 방법 선택   2.결제 완료   3.결제 취소   4.결제 재등록

원하는 항목을 선택해주세요

번호: 1

==결제 방법 선택==
1.현금 2.카드 0.초기화면

번호:2

====결제 처리====
1.테이블 전체 결제
2.분할 결제
0.뒤로 가기

번호:1

결제하시겠습니까?
1.예 2.아니오

번호:1

-----------------------포스관리 프로그램--------------------------
1.주문   2.결제   3.메뉴관리   4.통계   5.프로그램 종료
--------------------------------------------------------------
이동하고 싶은 메뉴 번호를 입력하세요 :



